analogdevicesinc/MAX78xxx-RefDes/maxrefdes178-UNet/maxrefdes178_max32666/src/max32666_main.c
/*******************************************************************************
 * Copyright (C) Maxim Integrated Products, Inc., All rights Reserved.
 *
 * This software is protected by copyright laws of the United States and
 * of foreign countries. This material may also be protected by patent laws
 * and technology transfer regulations of the United States and of foreign
 * countries. This software is furnished under a license agreement and/or a
 * nondisclosure agreement and may only be used or reproduced in accordance
 * with the terms of those agreements. Dissemination of this information to
 * any party or parties not specified in the license agreement and/or
 * nondisclosure agreement is expressly prohibited.
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *******************************************************************************
 */

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <board.h>
#include <core1.h>
#include <dma.h>
#include <icc_regs.h>
#include <mxc_delay.h>
#include <mxc_sys.h>
#include <nvic_table.h>
#include <stdint.h>
#include <string.h>
#include <tmr.h>
#include <stdlib.h>

#include "max32666_accel.h"
#include "max32666_audio_codec.h"
//#include "max32666_ble.h"
//#include "max32666_ble_command.h"
//#include "max32666_ble_queue.h"
#include "max32666_data.h"
#include "max32666_debug.h"
#include "max32666_expander.h"
#include "max32666_ext_flash.h"
#include "max32666_ext_sram.h"
#include "max32666_fonts.h"
#include "max32666_fuel_gauge.h"
#include "max32666_i2c.h"
#include "max32666_lcd.h"
#include "max32666_lcd_images.h"
#include "max32666_pmic.h"
#include "max32666_powmon.h"
#include "max32666_qspi_master.h"
#include "max32666_sdcard.h"
#include "max32666_spi_dma.h"
#include "max32666_timer_led_button.h"
#include "max32666_touch.h"
#include "max32666_usb.h"
#include "maxrefdes178_definitions.h"
#include "maxrefdes178_version.h"


//-----------------------------------------------------------------------------
// Defines
//-----------------------------------------------------------------------------
#define S_MODULE_NAME   "main"


//-----------------------------------------------------------------------------
// Typedefs
//-----------------------------------------------------------------------------
#define ALPHA  0.35  // alpha value for overlaid mask

#define BRG(r,g,b)  (((r&0xF8)<<8)|((g&0xFC)<<3)|((b&0xF8)>>3)) //5 red | 6 green | 5 blue

//-----------------------------------------------------------------------------
// Global variables
//-----------------------------------------------------------------------------
static volatile int core1_init_done = 0;
static char lcd_string_buff[LCD_NOTIFICATION_MAX_SIZE] = {0};
static char version_string[14] = {0};
static char usn_string[(sizeof(serial_num_t) + 1) * 3] = {0};
static char mac_string[(sizeof(device_info.ble_mac) + 1) * 3] = {0};
static uint16_t video_string_color;
static uint16_t video_frame_color;
static uint16_t audio_string_color;

uint16_t mask_data[LCD_WIDTH * LCD_HEIGHT];
//-----------------------------------------------------------------------------
// Local function declarations
//-----------------------------------------------------------------------------
static void core0_irq_init(void);
static void core1_irq_init(void);
static void core0_icc(int enable);
static void core1_icc(int enable);
static void run_application(void);
static int refresh_screen(void);

static void update_mask(uint32_t mask);

//-----------------------------------------------------------------------------
// Function definitions
//-----------------------------------------------------------------------------
int main(void)
{
    int ret = 0;

    // Set PORT1 and PORT2 rail to VDDIO
    MXC_GPIO0->vssel = 0x00;
    MXC_GPIO1->vssel = 0x00;

    // Disable Core0 ICC0 Instruction cache
    core0_icc(0);

    ret = MXC_SEMA_Init();
    if (ret != E_NO_ERROR) {
        printf("MXC_SEMA_Init failed %d\n", ret);
        MXC_Delay(MXC_DELAY_MSEC(100));
        MXC_SYS_Reset_Periph(MXC_SYS_RESET_SYSTEM);
    }

    device_info.device_version.max32666.major = S_VERSION_MAJOR;
    device_info.device_version.max32666.minor = S_VERSION_MINOR;
    device_info.device_version.max32666.build = S_VERSION_BUILD;
    snprintf(version_string, sizeof(version_string) - 1, "v%d.%d.%d", S_VERSION_MAJOR, S_VERSION_MINOR, S_VERSION_BUILD);
    snprintf(device_info.max32666_demo_name, sizeof(device_info.max32666_demo_name) - 1, "%s", UNET_DEMO_NAME);
    PR("\n\n\n");
    PR_INFO("maxrefdes178_max32666 %s core0 %s [%s]", device_info.max32666_demo_name, version_string, S_BUILD_TIMESTAMP);

    ret = i2c_master_init();
    if (ret != E_NO_ERROR) {
        PR_ERROR("i2c_init failed %d", ret);
        MXC_Delay(MXC_DELAY_MSEC(100));
        MXC_SYS_Reset_Periph(MXC_SYS_RESET_SYSTEM);
    }

    ret = expander_init();
    if (ret != E_NO_ERROR) {
        PR_ERROR("expander_init failed %d", ret);
        MXC_Delay(MXC_DELAY_MSEC(100));
        MXC_SYS_Reset_Periph(MXC_SYS_RESET_SYSTEM);
    }

