analogdevicesinc/MAX78xxx-RefDes/maxrefdes178-UNet/maxrefdes178_max32666/src/max32666_main.c
    ret = pmic_init();
    if (ret != E_NO_ERROR) {
        PR_ERROR("pmic_init failed %d", ret);
        MXC_Delay(MXC_DELAY_MSEC(100));
        MXC_SYS_Reset_Periph(MXC_SYS_RESET_SYSTEM);
    }
    pmic_led_green(1);

   // BLE should init first since it is mischievous
   // BLE init somehow damages GPIO settings for P0.0, P0.23
    core0_irq_init();
    Core1_Start();

    for(uint32_t cnt = 10000000; !core1_init_done && cnt; cnt--) {
        if (cnt == 1) {
            PR_ERROR("timeout, reset");
            MXC_Delay(MXC_DELAY_MSEC(100));
            MXC_SYS_Reset_Periph(MXC_SYS_RESET_SYSTEM);
        }
    }

    ret = fuel_gauge_init();
    if (ret != E_NO_ERROR) {
        PR_ERROR("fuel_gauge_init failed %d", ret);
        pmic_led_red(1);
        MXC_Delay(MXC_DELAY_MSEC(100));
        MXC_SYS_Reset_Periph(MXC_SYS_RESET_SYSTEM);
    }

    // Initialize DMA peripheral
    ret = MXC_DMA_Init(MXC_DMA0);
    if (ret != E_NO_ERROR) {
        PR_ERROR("MXC_DMA_Init failed %d", ret);
        pmic_led_red(1);
        MXC_Delay(MXC_DELAY_MSEC(100));
        MXC_SYS_Reset_Periph(MXC_SYS_RESET_SYSTEM);
    }

//    ret = ext_sram_init();
//    if (ret != E_NO_ERROR) {
//        PR_ERROR("ext_sram_init failed %d", ret);
//        pmic_led_red(1);
//    }

    ret = lcd_init();
    if (ret != E_NO_ERROR) {
        PR_ERROR("lcd_init failed %d", ret);
        pmic_led_red(1);
        MXC_Delay(MXC_DELAY_MSEC(100));
        MXC_SYS_Reset_Periph(MXC_SYS_RESET_SYSTEM);
    }

    ret = qspi_master_init();
    if (ret != E_NO_ERROR) {
        PR_ERROR("qspi_naster_init failed %d", ret);
        pmic_led_red(1);
        MXC_Delay(MXC_DELAY_MSEC(100));
        MXC_SYS_Reset_Periph(MXC_SYS_RESET_SYSTEM);
    }

    ret = timer_led_button_init();
    if (ret != E_NO_ERROR) {
        PR_ERROR("timer_led_button_init failed %d", ret);
        pmic_led_red(1);
    }

    ret = accel_init();
    if (ret != E_NO_ERROR) {
        PR_ERROR("accel_init failed %d", ret);
        pmic_led_red(1);
    }

    ret = touch_init();
    if (ret != E_NO_ERROR) {
        PR_ERROR("touch_init failed %d", ret);
        pmic_led_red(1);
    }

//    ret = powmon_init();
//    if (ret != E_NO_ERROR) {
//        PR_ERROR("powmon_init failed %d", ret);
//        pmic_led_red(1);
//    }
//
//    ret = usb_init();
//    if (ret != E_NO_ERROR) {
//        PR_ERROR("usb_init failed %d", ret);
//        pmic_led_red(1);
//    }
//
//    ret = ext_flash_init();
//    if (ret != E_NO_ERROR) {
//        PR_ERROR("ext_flash_init failed %d", ret);
//        pmic_led_red(1);
//    }
//
//    ret = audio_codec_init();
//    if (ret != E_NO_ERROR) {
//        PR_ERROR("audio_codec_init failed %d", ret);
//        pmic_led_red(1);
//    }
//
//    ret = sdcard_init();
//    if (ret != E_NO_ERROR) {
//        PR_ERROR("sdcard_init failed %d", ret);
//        pmic_led_red(1);
//    }
//
//    ret = ble_queue_init();
//    if (ret != E_NO_ERROR) {
//        PR_ERROR("ble_queue_init failed %d", ret);
//        pmic_led_red(1);
//    }
//
//    ret = ble_command_init();
//    if (ret != E_NO_ERROR) {
//        PR_ERROR("ble_command_init failed %d", ret);
//        pmic_led_red(1);
//    }

    ret = MXC_SYS_GetUSN(device_info.device_serial_num.max32666, sizeof(device_info.device_serial_num.max32666));
    if (ret != E_NO_ERROR) {
        PR_ERROR("MXC_SYS_GetUSN failed %d", ret);
        pmic_led_red(1);
    }
    snprintf(usn_string, sizeof(usn_string) - 1, "%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X",
            device_info.device_serial_num.max32666[0],
            device_info.device_serial_num.max32666[1],
            device_info.device_serial_num.max32666[2],
            device_info.device_serial_num.max32666[3],
            device_info.device_serial_num.max32666[4],
            device_info.device_serial_num.max32666[5],
            device_info.device_serial_num.max32666[6],
            device_info.device_serial_num.max32666[7],
            device_info.device_serial_num.max32666[8],
            device_info.device_serial_num.max32666[9],
            device_info.device_serial_num.max32666[10],
            device_info.device_serial_num.max32666[11],
            device_info.device_serial_num.max32666[12]);
    PR_INFO("MAX32666 Serial number: %s", usn_string);

//    snprintf(mac_string, sizeof(mac_string) - 1, "%02X:%02X:%02X:%02X:%02X:%02X",
//            device_info.ble_mac[5], device_info.ble_mac[4], device_info.ble_mac[3],
//            device_info.ble_mac[2], device_info.ble_mac[1], device_info.ble_mac[0]);
//    PR_INFO("MAX32666 BLE MAC: %s", mac_string);

    /* Select USB-Type-C Debug Connection to MAX78000-Video on IO expander */
    if ((ret = expander_select_debugger(DEBUGGER_SELECT_MAX78000_VIDEO)) != E_NO_ERROR) {
       PR_ERROR("expander_debug_select failed %d", ret);
       pmic_led_red(1);
    }

    // Print logo and version
    fonts_putStringCentered(LCD_HEIGHT - 63, version_string, &Font_16x26, BLACK, maxim_logo);
    fonts_putStringCentered(LCD_HEIGHT - 38, mac_string, &Font_11x18, BLUE, maxim_logo);
    fonts_putStringCentered(3, usn_string, &Font_7x10, BLACK, maxim_logo);
    fonts_putStringCentered(55, device_info.max32666_demo_name, &Font_16x26, MAGENTA, maxim_logo);
    lcd_drawImage(maxim_logo);

    // Wait MAX78000s
    MXC_Delay(MXC_DELAY_MSEC(600));

    // Get information from MAX78000
    {
        qspi_packet_type_e qspi_packet_type_rx = 0;
        for (int try = 0; try < 3; try++) {
            qspi_master_send_video(NULL, 0, QSPI_PACKET_TYPE_VIDEO_FACEID_SUBJECTS_CMD);
            qspi_master_wait_video_int();
            qspi_master_video_rx_worker(&qspi_packet_type_rx);
            if (device_status.faceid_embed_subject_names_size) {
                break;
            }
        }

        for (int try = 0; try < 3; try++) {
            qspi_master_send_video(NULL, 0, QSPI_PACKET_TYPE_VIDEO_VERSION_CMD);
            qspi_master_wait_video_int();
            qspi_master_video_rx_worker(&qspi_packet_type_rx);
            if (device_info.device_version.max78000_video.major || device_info.device_version.max78000_video.minor) {
                break;
            }
        }
        for (int try = 0; try < 3; try++) {
            qspi_master_send_audio(NULL, 0, QSPI_PACKET_TYPE_AUDIO_VERSION_CMD);
            qspi_master_wait_audio_int();
            qspi_master_audio_rx_worker(&qspi_packet_type_rx);
            if (device_info.device_version.max78000_audio.major || device_info.device_version.max78000_audio.minor) {
                break;
            }
        }

        for (int try = 0; try < 3; try++) {
            qspi_master_send_video(NULL, 0, QSPI_PACKET_TYPE_VIDEO_DEMO_NAME_CMD);
            qspi_master_wait_video_int();
            qspi_master_video_rx_worker(&qspi_packet_type_rx);
            if (device_info.max78000_video_demo_name[0]) {
                break;
            }
        }
        for (int try = 0; try < 3; try++) {
            qspi_master_send_audio(NULL, 0, QSPI_PACKET_TYPE_AUDIO_DEMO_NAME_CMD);
            qspi_master_wait_audio_int();
            qspi_master_audio_rx_worker(&qspi_packet_type_rx);
            if (device_info.max78000_audio_demo_name[0]) {
                break;
            }
        }

        ret = E_NO_ERROR;
        // Check video and audio fw version
        if (!(device_info.device_version.max78000_video.major || device_info.device_version.max78000_video.minor)) {
            PR_ERROR("max78000_video communication error");
            ret = E_COMM_ERR;
            snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "No video comm");
            fonts_putStringCentered(100, lcd_string_buff, &Font_11x18, RED, maxim_logo);
        } else if (memcmp(&device_info.device_version.max32666, &device_info.device_version.max78000_video, sizeof(version_t))) {
            PR_ERROR("max32666 and max78000_video versions are different");
            ret = E_INVALID;
            snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "video fw err %d.%d.%d",
                    device_info.device_version.max78000_video.major,
                    device_info.device_version.max78000_video.minor,
                    device_info.device_version.max78000_video.build);
            fonts_putStringCentered(100, lcd_string_buff, &Font_11x18, RED, maxim_logo);
        } else if (strncmp(device_info.max32666_demo_name, device_info.max78000_video_demo_name, DEMO_STRING_SIZE)) {
            PR_ERROR("max32666 and max78000_video demos are different");
            ret = E_INVALID;
            snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "video fw demo err %s", device_info.max78000_video_demo_name);
            fonts_putStringCentered(100, lcd_string_buff, &Font_11x18, RED, maxim_logo);
        }

        if (!(device_info.device_version.max78000_audio.major || device_info.device_version.max78000_audio.minor)) {
            PR_ERROR("max78000_audio communication error");
            ret = E_COMM_ERR;
            snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "No audio comm");
            fonts_putStringCentered(130, lcd_string_buff, &Font_11x18, RED, maxim_logo);
        } else if (memcmp(&device_info.device_version.max32666, &device_info.device_version.max78000_audio, sizeof(version_t))) {
            PR_ERROR("max32666 and max78000_audio versions are different");
            ret = E_INVALID;
            snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "audio fw err %d.%d.%d",
                    device_info.device_version.max78000_audio.major,
                    device_info.device_version.max78000_audio.minor,
                    device_info.device_version.max78000_audio.build);
            fonts_putStringCentered(130, lcd_string_buff, &Font_11x18, RED, maxim_logo);
        } else if (strncmp(device_info.max32666_demo_name, device_info.max78000_audio_demo_name, DEMO_STRING_SIZE)) {
            PR_ERROR("max32666 and max78000_audio demos are different");
            ret = E_INVALID;
            snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "audio fw demo err %s", device_info.max78000_audio_demo_name);
            fonts_putStringCentered(130, lcd_string_buff, &Font_11x18, RED, maxim_logo);
        }

        if (ret != E_NO_ERROR) {
            lcd_drawImage(maxim_logo);
            pmic_led_red(1);
            while(1) {
//                if (device_settings.enable_ble && device_status.ble_connected) {
//                    ble_command_worker();
//                }
                expander_worker();

