analogdevicesinc/MAX78xxx-RefDes/maxrefdes178-UNet/maxrefdes178_max32666/src/max32666_main.c
                if (lcd_data.refresh_screen && !spi_dma_busy_flag(MAX32666_LCD_DMA_CHANNEL)) {
                    memcpy(lcd_data.buffer, maxim_logo, sizeof(lcd_data.buffer));
                    if (strlen(lcd_data.notification) < (LCD_WIDTH / Font_11x18.width)) {
                        fonts_putStringCentered(LCD_HEIGHT - Font_11x18.height - 3, lcd_data.notification, &Font_11x18, lcd_data.notification_color, lcd_data.buffer);
                    } else {
                        fonts_putStringCentered(LCD_HEIGHT - Font_7x10.height - 3, lcd_data.notification, &Font_7x10, lcd_data.notification_color, lcd_data.buffer);
                    }
                    lcd_drawImage(lcd_data.buffer);
                }
            }
        }
    }

    PR_INFO("core 0 init completed");

    // print application name
    snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "Audio enabled");
    fonts_putStringCentered(37, lcd_string_buff, &Font_11x18, RED, maxim_logo);

    run_application();

    return E_NO_ERROR;
}

static void run_application(void)
{
    qspi_packet_type_e qspi_packet_type_rx = 0;
    video_frame_color = WHITE;
    uint16_t touch_x1, touch_y1;

    core0_icc(1);


    // Main application loop
    while (1) {

        // Handle Video QSPI RX
        if (qspi_master_video_rx_worker(&qspi_packet_type_rx) == E_NO_ERROR) {
            switch(qspi_packet_type_rx) {
            case QSPI_PACKET_TYPE_VIDEO_DATA_RES:
                timestamps.video_data_received = timer_ms_tick;
                lcd_data.refresh_screen = 1;
                break;
				
			case QSPI_PACKET_TYPE_VIDEO_ML_RES: // show ML Mask
				update_mask(0x7f);
                timestamps.video_data_received = timer_ms_tick;
                lcd_data.refresh_screen = 1;
                break;
				
            case QSPI_PACKET_TYPE_VIDEO_CLASSIFICATION_RES:
                timestamps.activity_detected = timer_ms_tick;
                if (device_status.classification_video.classification == CLASSIFICATION_UNKNOWN) {
                    video_string_color = RED;
                    video_frame_color = RED;
                } else if (device_status.classification_video.classification == CLASSIFICATION_LOW_CONFIDENCE) {
                    video_string_color = YELLOW;
                    video_frame_color = YELLOW;
                } else if (device_status.classification_video.classification == CLASSIFICATION_DETECTED) {
                    video_string_color = GREEN;
                    video_frame_color = GREEN;
                } else if (device_status.classification_video.classification == CLASSIFICATION_NOTHING) {
                    video_frame_color = WHITE;
                }

//                if (device_settings.enable_ble_send_classification && device_status.ble_connected) {
//                    ble_command_send_single_packet(BLE_COMMAND_GET_MAX78000_VIDEO_CLASSIFICATION_RES,
//                        sizeof(device_status.classification_video), (uint8_t *) &device_status.classification_video);
//                }
                break;
            case QSPI_PACKET_TYPE_VIDEO_FACEID_EMBED_UPDATE_RES:
//                if (device_status.ble_connected) {
//                    ble_command_send_single_packet(BLE_COMMAND_FACEID_EMBED_UPDATE_RES,
//                        sizeof(device_status.faceid_embed_update_status), (uint8_t *) &device_status.faceid_embed_update_status);
//                }
                qspi_master_send_video(NULL, 0, QSPI_PACKET_TYPE_VIDEO_FACEID_SUBJECTS_CMD);
                lcd_notification(GREEN, "FaceID signature updated");
                break;
            case QSPI_PACKET_TYPE_VIDEO_FACEID_SUBJECTS_RES:
                timestamps.faceid_subject_names_received = timer_ms_tick;
                break;
            default:
                break;
            }
        }


       // PR_INFO("LCD:%d VIDEO:%d CNN:%d AUDIO:%d",device_settings.enable_lcd, device_settings.enable_max78000_video
       // 		,device_settings.enable_max78000_video_cnn, device_settings.enable_max78000_audio);
        // Handle Audio QSPI RX
        if (qspi_master_audio_rx_worker(&qspi_packet_type_rx) == E_NO_ERROR) {
            switch(qspi_packet_type_rx) {
            case QSPI_PACKET_TYPE_AUDIO_CLASSIFICATION_RES:
                timestamps.audio_result_received = timer_ms_tick;
                timestamps.activity_detected = timer_ms_tick;

                if (device_status.classification_audio.classification == CLASSIFICATION_UNKNOWN) {
                    audio_string_color = RED;
                } else if (device_status.classification_audio.classification == CLASSIFICATION_LOW_CONFIDENCE) {
                    audio_string_color = YELLOW;
                } else if (device_status.classification_audio.classification == CLASSIFICATION_DETECTED) {
                    audio_string_color = YELLOW;//GREEN;

                    if (strncmp(device_status.classification_audio.result, "OFF", 3) == 0) {
                    	PR_INFO("OFF");
                        //  device_settings.enable_lcd = 0;
                        //  lcd_backlight(0, 0);
                        //  qspi_master_send_video(NULL, 0, QSPI_PACKET_TYPE_VIDEO_DISABLE_CMD);
                    } else if(strncmp(device_status.classification_audio.result, "ON", 2) == 0) {
                    	PR_INFO("ON");
                        device_settings.enable_lcd = 1;
                        if (device_settings.enable_max78000_video) {
                            qspi_master_send_video(NULL, 0, QSPI_PACKET_TYPE_VIDEO_ENABLE_CMD);
                        }
                        lcd_backlight(1, MAX32666_LCD_BACKLIGHT_HIGH);

                        // also enable cnn
                        device_settings.enable_max78000_video_cnn = 1;
                        //  qspi_master_send_video(NULL, 0, QSPI_PACKET_TYPE_VIDEO_ENABLE_CNN_CMD);

                    } else if (strncmp(device_status.classification_audio.result, "GO", 2) == 0) {
                    	PR_INFO("GO");
                    	device_settings.enable_max78000_video_cnn = 1;
                        //  qspi_master_send_video(NULL, 0, QSPI_PACKET_TYPE_VIDEO_ENABLE_CNN_CMD);
                    } else if(strncmp(device_status.classification_audio.result, "STOP", 4) == 0) {
                    	PR_INFO("STOP");
                        //  device_settings.enable_max78000_video_cnn = 0;
                        //  qspi_master_send_video(NULL, 0, QSPI_PACKET_TYPE_VIDEO_DISABLE_CNN_CMD);

