analogdevicesinc/MAX78xxx-RefDes/maxrefdes178-UNet/maxrefdes178_max32666/src/max32666_main.c
                    }
                }

//                if (device_settings.enable_ble_send_classification && device_status.ble_connected) {
//                    ble_command_send_single_packet(BLE_COMMAND_GET_MAX78000_AUDIO_CLASSIFICATION_RES,
//                        sizeof(device_status.classification_audio), (uint8_t *) &device_status.classification_audio);
//                }
                if (!device_settings.enable_max78000_video) {
                    lcd_data.refresh_screen = 1;
                }
                break;
            default:
                break;
            }
        }

        // Handle QSPI TX
        qspi_master_video_tx_worker();
        qspi_master_audio_tx_worker();

        // Send BLE periodic statistics
//        if (device_settings.enable_ble_send_statistics && device_status.ble_connected) {
//            if ((timer_ms_tick - timestamps.statistics_sent) > BLE_STATISTICS_INTERVAL) {
//                timestamps.statistics_sent = timer_ms_tick;
//                ble_command_send_single_packet(BLE_COMMAND_GET_STATISTICS_RES,
//                    sizeof(device_status.statistics), (uint8_t *) &device_status.statistics);
//            }
//        }

        if (device_settings.enable_max78000_video) {
            // If video is not available for a long time, draw logo and refresh periodically
            if ((timer_ms_tick - timestamps.video_data_received) > LCD_NO_VIDEO_REFRESH_DURATION) {
                timestamps.video_data_received = timer_ms_tick;
                memcpy(lcd_data.buffer, maxim_logo, sizeof(lcd_data.buffer));
                snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "No video!");
                fonts_putStringCentered(22, lcd_string_buff, &Font_11x18, RED, lcd_data.buffer);
                lcd_data.refresh_screen = 1;
            }
        } else {
            // If video is disabled, draw logo and refresh periodically
            if ((timer_ms_tick - timestamps.screen_drew) > LCD_VIDEO_DISABLE_REFRESH_DURATION) {
                memcpy(lcd_data.buffer, maxim_logo, sizeof(lcd_data.buffer));
                snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "Video disabled");
                fonts_putStringCentered(22, lcd_string_buff, &Font_11x18, RED, lcd_data.buffer);
                lcd_data.refresh_screen = 1;
            }
        }

//        // Handle BLE communication
//        if (device_settings.enable_ble && device_status.ble_connected) {
//            ble_command_worker();
//        }
//
//        // Check if BLE status changed
//        if (device_status.ble_connected_status_changed) {
//            device_status.ble_connected_status_changed = 0;
//
//            ble_queue_flush();
//            ble_command_reset();
//            device_settings.enable_ble_send_classification = 0;
//            device_settings.enable_ble_send_statistics = 0;
//
//            if (device_status.ble_connected) {
//                snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1,
//                        "BLE %02X:%02X:%02X:%02X:%02X:%02X connected!",
//                        device_status.ble_connected_peer_mac[5], device_status.ble_connected_peer_mac[4],
//                        device_status.ble_connected_peer_mac[3], device_status.ble_connected_peer_mac[2],
//                        device_status.ble_connected_peer_mac[1], device_status.ble_connected_peer_mac[0]);
//                lcd_notification(BLUE, lcd_string_buff);
//            } else {
//                lcd_notification(BLUE, "BLE disconnected!");
//            }
//        }
//
//        if (device_status.ble_running_status_changed) {
//            if (device_settings.enable_ble) {
//                PR_INFO("Enable Core1");
//                Core1_Start();
//            } else {
//                PR_INFO("Disable Core1");
//                Core1_Stop();
//            }
//            device_status.ble_running_status_changed = 0;
//        }

        // Check inactivity
        if (device_settings.enable_inactivity) {
            if ((timer_ms_tick - timestamps.activity_detected) > INACTIVITY_LONG_DURATION) {
                if (device_status.inactivity_state != INACTIVITY_STATE_INACTIVE_LONG) {
                    device_status.inactivity_state = INACTIVITY_STATE_INACTIVE_LONG;
                    // Switch to inactive long state
                    lcd_backlight(0, 0);
                    qspi_master_send_video(NULL, 0, QSPI_PACKET_TYPE_VIDEO_DISABLE_CMD);
                    PR_INFO("Inactive long");
                }
            } else if ((timer_ms_tick - timestamps.activity_detected) > INACTIVITY_SHORT_DURATION) {
                if (device_status.inactivity_state != INACTIVITY_STATE_INACTIVE_SHORT) {
                    device_status.inactivity_state = INACTIVITY_STATE_INACTIVE_SHORT;
                    // Switch to inactive short state
                    if (device_settings.enable_lcd) {
                        lcd_backlight(1, MAX32666_LCD_BACKLIGHT_LOW);
                    }
                    PR_INFO("Inactive short");
                }
            } else {
                if (device_status.inactivity_state != INACTIVITY_STATE_ACTIVE) {
                    device_status.inactivity_state = INACTIVITY_STATE_ACTIVE;
                    // Switch to active state
                    if (device_settings.enable_lcd) {
                        lcd_backlight(1, MAX32666_LCD_BACKLIGHT_HIGH);
                    }
                    if (device_settings.enable_max78000_video && device_settings.enable_lcd) {
                        MXC_Delay(MXC_DELAY_MSEC(600));
                        qspi_master_send_video(NULL, 0, QSPI_PACKET_TYPE_VIDEO_ENABLE_CMD);
                    }
                    PR_INFO("Active");
                }
            }
        }

        // Check PMIC and Fuel Gauge
        if ((timer_ms_tick - timestamps.pmic_check) > MAX32666_PMIC_INTERVAL) {
            timestamps.pmic_check = timer_ms_tick;
            pmic_worker();
            if (device_status.fuel_gauge_working) {
                fuel_gauge_worker();
            }
        }

        // Power accumulator worker
//        if ((timer_ms_tick - timestamps.powmon) > MAX32666_POWMON_INTERVAL) {
//            timestamps.powmon = timer_ms_tick;
//            powmon_worker();
//        }

