analogdevicesinc/MAX78xxx-RefDes/maxrefdes178-UNet/maxrefdes178_max32666/src/max32666_main.c
        // LED worker
        if ((timer_ms_tick - timestamps.led) > MAX32666_LED_INTERVAL) {
            timestamps.led = timer_ms_tick;
            led_worker();
        }

        // IO expander worker
        expander_worker();

        // Touch screen worker
        if (touch_worker(&touch_x1, &touch_y1) == E_NO_ERROR) {

            // Check if init page start button is clicked
            if (device_settings.enable_max78000_video == 0) {
                if ((LCD_START_BUTTON_X1 <= touch_x1) && (touch_x1 <= LCD_START_BUTTON_X2) &&
                    (LCD_START_BUTTON_Y1 <= touch_y1) && (touch_y1 <= LCD_START_BUTTON_Y2)) {
                    device_settings.enable_max78000_video = 1;
                    qspi_master_send_video(NULL, 0, QSPI_PACKET_TYPE_VIDEO_ENABLE_CMD);
                    PR_INFO("start button clicked");

                    // Start video
                    MXC_Delay(MXC_DELAY_MSEC(1000));
                    device_settings.enable_max78000_video_cnn = 1;
                   // qspi_master_send_video(NULL, 0, QSPI_PACKET_TYPE_VIDEO_ENABLE_CNN_CMD);
                }
            }

            PR_INFO("touch %d %d", touch_x1, touch_y1);
            timestamps.activity_detected = timer_ms_tick;
        }

        // Button worker
        button_worker();

        // USB worker
//        usb_worker();

        // Refresh LCD
        if (lcd_data.refresh_screen && device_settings.enable_lcd && !spi_dma_busy_flag(MAX32666_LCD_DMA_CHANNEL)) {
            refresh_screen();
        }

        // Sleep until an interrupt
        __WFI();
    }
}

static int refresh_screen(void)
{
    if (device_status.fuel_gauge_working) {
        snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "%3d%%", device_status.statistics.battery_soc);
        if (device_status.usb_chgin) {
            fonts_putString(LCD_WIDTH - 31, 3, lcd_string_buff, &Font_7x10, ORANGE, 0, 0, lcd_data.buffer);
        } else if (device_status.statistics.battery_soc <= MAX32666_SOC_WARNING_LEVEL) {
            fonts_putString(LCD_WIDTH - 31, 3, lcd_string_buff, &Font_7x10, RED, 0, 0, lcd_data.buffer);
        } else {
            fonts_putString(LCD_WIDTH - 31, 3, lcd_string_buff, &Font_7x10, GREEN, 0, 0, lcd_data.buffer);
        }
    }

    
/*   
    // Draw FaceID frame and result
    if (device_settings.enable_max78000_video && device_settings.enable_max78000_video_cnn) {
        if (device_status.classification_video.classification != CLASSIFICATION_NOTHING) {
            strncpy(lcd_string_buff, device_status.classification_video.result, sizeof(lcd_string_buff) - 1);
            fonts_putStringCentered(LCD_HEIGHT - 29, lcd_string_buff, &Font_16x26, video_string_color, lcd_data.buffer);
        }
        fonts_drawRectangle(FACEID_RECTANGLE_X1 - 0, FACEID_RECTANGLE_Y1 - 0, FACEID_RECTANGLE_X2 + 0, FACEID_RECTANGLE_Y2 + 0, video_frame_color, lcd_data.buffer);
        fonts_drawRectangle(FACEID_RECTANGLE_X1 - 1, FACEID_RECTANGLE_Y1 - 1, FACEID_RECTANGLE_X2 + 1, FACEID_RECTANGLE_Y2 + 1, video_frame_color, lcd_data.buffer);
        fonts_drawRectangle(FACEID_RECTANGLE_X1 - 2, FACEID_RECTANGLE_Y1 - 2, FACEID_RECTANGLE_X2 + 2, FACEID_RECTANGLE_Y2 + 2, BLACK, lcd_data.buffer);
        fonts_drawRectangle(FACEID_RECTANGLE_X1 - 3, FACEID_RECTANGLE_Y1 - 3, FACEID_RECTANGLE_X2 + 3, FACEID_RECTANGLE_Y2 + 3, BLACK, lcd_data.buffer);
    }
*/
    if (device_settings.enable_lcd_statistics) {
        int line_pos = 3;

        // LCD frame per seconds
        snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "FPS:%.2f", (double)device_status.statistics.lcd_fps);
        fonts_putString(3, line_pos, lcd_string_buff, &Font_7x10, MAGENTA, 0, 0, lcd_data.buffer);
        line_pos += 12;

        // FaceID duration (MAX78000 Video CNN)
        snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "UNet:%d us", device_status.statistics.max78000_video.cnn_duration_us);
        fonts_putString(3, line_pos, lcd_string_buff, &Font_7x10, MAGENTA, 0, 0, lcd_data.buffer);
        line_pos += 12;

        // KWS duration (MAX78000 Audio CNN)
        snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "KWS:%d us", device_status.statistics.max78000_audio.cnn_duration_us);
        fonts_putString(3, line_pos, lcd_string_buff, &Font_7x10, MAGENTA, 0, 0, lcd_data.buffer);
        line_pos += 12;

        // Video camera capture duration (frame capture)
        snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "VidCap:%d ms", device_status.statistics.max78000_video.capture_duration_us / 1000);
        fonts_putString(3, line_pos, lcd_string_buff, &Font_7x10, MAGENTA, 0, 0, lcd_data.buffer);
        line_pos += 12;

        // Video communication duration (frame transfer from MAX78000 to MAX32666 over QSPI)
        snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "VidComm:%d ms", device_status.statistics.max78000_video.communication_duration_us / 1000);
        fonts_putString(3, line_pos, lcd_string_buff, &Font_7x10, MAGENTA, 0, 0, lcd_data.buffer);
        line_pos += 12;

//        // MAX78000 Video power
//        snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "Vid:%d mW", device_status.statistics.max78000_video_cnn_power_mw);
//        fonts_putString(3, line_pos, lcd_string_buff, &Font_7x10, MAGENTA, 0, 0, lcd_data.buffer);
//        line_pos += 12;
//
//        // MAX78000 Audio power
//        snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "Aud:%d mW", device_status.statistics.max78000_audio_cnn_power_mw);
//        fonts_putString(3, line_pos, lcd_string_buff, &Font_7x10, MAGENTA, 0, 0, lcd_data.buffer);
//        line_pos += 12;

        if ((timestamps.screen_drew - timestamps.faceid_subject_names_received) < LCD_NOTIFICATION_DURATION) {
            line_pos += 5;
            for (int i = 0; i < device_status.faceid_embed_subject_names_size; i += strlen(&device_status.faceid_embed_subject_names[i]) + 1) {
                snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "%s", &device_status.faceid_embed_subject_names[i]);
                fonts_putString(3, line_pos, lcd_string_buff, &Font_7x10, CYAN, 0, 0, lcd_data.buffer);
                line_pos += 12;
            }
        }
    }

    // Draw button in init screen
    if (device_settings.enable_max78000_video == 0) {
        // Start button
        fonts_drawFilledRectangle(LCD_START_BUTTON_X1, LCD_START_BUTTON_Y1, LCD_START_BUTTON_X2 - LCD_START_BUTTON_X1,
                                  LCD_START_BUTTON_Y2 - LCD_START_BUTTON_Y1, LGRAY, lcd_data.buffer);
        fonts_drawThickRectangle(LCD_START_BUTTON_X1, LCD_START_BUTTON_Y1, LCD_START_BUTTON_X2, LCD_START_BUTTON_Y2, BLACK, 4, lcd_data.buffer);
        snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "Start Video");
        fonts_putStringCentered(LCD_START_BUTTON_Y1 + 10, lcd_string_buff, &Font_16x26, GREEN, lcd_data.buffer);
    }

