analogdevicesinc/MAX78xxx-RefDes/maxrefdes178-UNet/maxrefdes178_max32666/src/max32666_main.c
    if (device_settings.enable_max78000_audio) {
        if ((timestamps.screen_drew - timestamps.audio_result_received) < LCD_CLASSIFICATION_DURATION) {
            if (device_settings.enable_lcd_probabilty) {
                snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "%s (%d%%)",
                        device_status.classification_audio.result, (uint8_t) device_status.classification_audio.probabily);
            } else {
                strncpy(lcd_string_buff, device_status.classification_audio.result, sizeof(lcd_string_buff) - 1);
            }

            fonts_putStringCentered(3, lcd_string_buff, &Font_16x26, audio_string_color, lcd_data.buffer);
        }
    } else {
        snprintf(lcd_string_buff, sizeof(lcd_string_buff) - 1, "Audio disabled");
        fonts_putStringCentered(3, lcd_string_buff, &Font_11x18, RED, lcd_data.buffer);
    }

    if ((timestamps.screen_drew - timestamps.notification_received) < LCD_NOTIFICATION_DURATION) {
        if (strlen(lcd_data.notification) < (LCD_WIDTH / Font_11x18.width)) {
            fonts_putStringCentered(LCD_HEIGHT - Font_11x18.height - 3, lcd_data.notification, &Font_11x18, lcd_data.notification_color, lcd_data.buffer);
        } else {
            fonts_putStringCentered(LCD_HEIGHT - Font_7x10.height - 3, lcd_data.notification, &Font_7x10, lcd_data.notification_color, lcd_data.buffer);
        }
    }

    if (lcd_drawImage(lcd_data.buffer) == E_NO_ERROR) {
        device_status.statistics.lcd_fps = (float) 1000.0 / (float)(timer_ms_tick - timestamps.screen_drew);
        timestamps.screen_drew = timer_ms_tick;
    }

    return E_NO_ERROR;
}

// Similar to Core 0, the entry point for Core 1
// is Core1Main()
// Execution begins when the CPU1 Clock is enabled
int Core1_Main(void)
{
    //  __asm__("BKPT");

    // Disable Core1 ICC1 Instruction cache
    core1_icc(0);

//    int ret = 0;

    PR_INFO("maxrefdes178_max32666 core1");

    core1_irq_init();

//    ret = ble_init();
//    if (ret != E_NO_ERROR) {
//        PR_ERROR("ble_init %d", ret);
//    }

    core1_init_done = 1;

    PR_INFO("core 1 init completed");

//    core1_icc(1);

    while (1) {
//        ble_worker();
    }

    return E_NO_ERROR;
}

static void core0_irq_init(void)
{
    // Disable all interrupts used by core1
//    NVIC_DisableIRQ(SysTick_IRQn);

    NVIC_DisableIRQ(BTLE_TX_DONE_IRQn);
    NVIC_DisableIRQ(BTLE_RX_RCVD_IRQn);
    NVIC_DisableIRQ(BTLE_RX_ENG_DET_IRQn);
    NVIC_DisableIRQ(BTLE_SFD_DET_IRQn);
    NVIC_DisableIRQ(BTLE_SFD_TO_IRQn);
    NVIC_DisableIRQ(BTLE_GP_EVENT_IRQn);
    NVIC_DisableIRQ(BTLE_CFO_IRQn);
    NVIC_DisableIRQ(BTLE_SIG_DET_IRQn);
    NVIC_DisableIRQ(BTLE_AGC_EVENT_IRQn); // Disabled
    NVIC_DisableIRQ(BTLE_RFFE_SPIM_IRQn);
    NVIC_DisableIRQ(BTLE_TX_AES_IRQn); // Disabled
    NVIC_DisableIRQ(BTLE_RX_AES_IRQn); // Disabled
    NVIC_DisableIRQ(BTLE_INV_APB_ADDR_IRQn); // Disabled
    NVIC_DisableIRQ(BTLE_IQ_DATA_VALID_IRQn); // Disabled

    NVIC_DisableIRQ(MXC_TMR_GET_IRQ(MXC_TMR_GET_IDX(MAX32666_TIMER_BLE)));
    NVIC_DisableIRQ(MXC_TMR_GET_IRQ(MXC_TMR_GET_IDX(MAX32666_TIMER_BLE_SLEEP)));

    NVIC_DisableIRQ(WUT_IRQn);
}

static void core1_irq_init(void)
{
//    NVIC_DisableIRQ(SysTick_IRQn);

    NVIC_DisableIRQ(GPIO0_IRQn);
    NVIC_DisableIRQ(GPIO1_IRQn);

    NVIC_DisableIRQ(MXC_TMR_GET_IRQ(MXC_TMR_GET_IDX(MAX32666_TIMER_MS)));
}

static void core0_icc(int enable)
{
    MXC_ICC0->invalidate = 1;
    while (!(MXC_ICC0->cache_ctrl & MXC_F_ICC_CACHE_CTRL_RDY));
    if (enable) {
        MXC_ICC0->cache_ctrl |= MXC_F_ICC_CACHE_CTRL_EN;
    } else {
        MXC_ICC0->cache_ctrl &= ~MXC_F_ICC_CACHE_CTRL_EN;
    }
    while (!(MXC_ICC0->cache_ctrl & MXC_F_ICC_CACHE_CTRL_RDY));
}

static void core1_icc(int enable)
{
    MXC_ICC1->invalidate = 1;
    while (!(MXC_ICC1->cache_ctrl & MXC_F_ICC_CACHE_CTRL_RDY));
    if (enable) {
        MXC_ICC1->cache_ctrl |= MXC_F_ICC_CACHE_CTRL_EN;
    } else {
        MXC_ICC1->cache_ctrl &= ~MXC_F_ICC_CACHE_CTRL_EN;
    }
    while (!(MXC_ICC1->cache_ctrl & MXC_F_ICC_CACHE_CTRL_RDY));
}


void update_mask(uint32_t mask)
{
	
  int r;
  int g;
  int b;
  int i;
  int8_t rr, gg, bb, uu;
  uint32_t x, y;
  uint32_t color;
  int32_t max = 0;
  uint32_t max_index = 0;
 
  uint32_t cnt=0;
  
  int8_t *ml_data8 = lcd_data.ml_data8;

  x = 0;
  y = 0;

  for (i = 0; i < UNET_IMAGE_SIZE_X*UNET_IMAGE_SIZE_Y; i++)
  {
		max = -256; // smaller than -128
		max_index = 0;

		rr = ml_data8[i];
		bb = ml_data8[i + UNET_IMAGE_SIZE_X * UNET_IMAGE_SIZE_Y];  //swapped b&g
		gg = ml_data8[i + 2 * UNET_IMAGE_SIZE_X * UNET_IMAGE_SIZE_Y];
		uu = ml_data8[i + 3 * UNET_IMAGE_SIZE_X * UNET_IMAGE_SIZE_Y];
		//printf("[%d] %d  %d  %d  %d \n",i,rr, bb, gg, uu);

		if (rr > max)
		{
		  max = rr;
		  max_index = 0;
		}
		if (gg > max)
		{
		  max = gg;
		  max_index = 1;
		}
		if (bb > max)
		{
		  max = bb;
		  max_index = 2;
		}
		if (uu > max)
		{
		  max = uu;
		  max_index = 3;
		}

		//printf("[%d] %d  %d  \n",i,max,max_index);

		// set mask color
		switch(max_index)
		{
		   case 0:
			   r = mask;
			   g = 0;
			   b = 0;
			   break;
		   case 1:
			   r = 0;
			   g = mask;
			   b = 0;
			  break;
		   case 2:
			   r = 0;
			   g = 0;
			   b = mask;
			   break;
		   case 3:
			   r = 0;
			   g = 0;
			   b = 0;
			   break;

		   default:
			  printf("ERROR");
			  while(1);
		}

		color = BRG(b, r, g); // convert to RGB565 as needed by TFT

		// repeat samples to convert 80x80 to 240x240
		mask_data[3*x + 3*y*LCD_WIDTH] = color;
		mask_data[3*x + (3*y+1)*LCD_WIDTH] = color;
		mask_data[3*x + (3*y+2)*LCD_WIDTH] = color;

		mask_data[3*x + 1 + 3*y*LCD_WIDTH] = color;
		mask_data[3*x + 1 + (3*y+1)*LCD_WIDTH] = color;
		mask_data[3*x + 1 + (3*y+2)*LCD_WIDTH] = color;

		mask_data[3*x + 2 + 3*y*LCD_WIDTH] = color;
		mask_data[3*x + 2 + (3*y+1)*LCD_WIDTH] = color;
		mask_data[3*x + 2 + (3*y+2)*LCD_WIDTH] = color;

		cnt+=9;

		x += 1;
		if (x >= (UNET_IMAGE_SIZE_X)) {
		  x = 0;
		  y += 1;
	}
	
 }	    
	  
 memcpy(lcd_data.buffer, mask_data, LCD_DATA_SIZE);
 // printf("Total count: %d\r\n", cnt);	
}
